Repository: jiachenyee/Pedagram
Catalog: ClassroomObservation/Localizable.xcstrings
Source language: en
Languages: id, th, vi

source: %@ Observation
id: Observasi %@
th: %@ การสังเกตการณ์
vi: Quan sát lúc %@

source: %lld hours
id: %lld jam
th: %lld ชั่วโมง
vi: %lld giờ

# %lld hours %lld minutes
source: %1$lld hours %2$lld minutes
id: %1$lld jam %2$lld menit
th: %1$lld ชั่วโมง %2$lld นาที
vi: %1$lld giờ %2$lld phút

source: %lld minutes
id: %lld menit
th: %lld นาที
vi: %lld phút

# %lld of %lld
source: %1$lld of %2$lld
id: %1$lld dari %2$lld
th: %1$lld จาก %2$lld
vi: %1$lld trong số %2$lld

source: A shorter observation durations can provide more granular data entry, while longer durations can provide more time for data entry. Select the one you are most comfortable with. When starting out, it is recommended to go with 15 minutes to familiarise yourself with the process and questions.
id: Durasi observasi yang lebih pendek dapat memberikan entri data yang lebih terperinci, sementara durasi yang lebih panjang dapat memberikan lebih banyak waktu untuk entri data. Pilih yang paling sesuai dengan Anda. Saat memulai, sebaiknya gunakan waktu 15 menit untuk membiasakan diri dengan proses dan pertanyaan.
th: ระยะเวลาการสังเกตที่สั้นลงสามารถให้รายละเอียดการป้อนข้อมูลได้มากขึ้น ในขณะที่ระยะเวลาที่นานขึ้นสามารถให้เวลาในการป้อนข้อมูลได้มากขึ้น เลือกระยะเวลาที่คุณสะดวกที่สุด เมื่อเริ่มต้น ขอแนะนำให้ใช้เวลา 15 นาทีเพื่อทำความคุ้นเคยกับกระบวนการและคำถามต่างๆ
vi: Thời gian quan sát ngắn hơn có thể cung cấp dữ liệu chi tiết hơn, trong khi thời gian quan sát dài hơn có thể cung cấp nhiều thời gian hơn để nhập dữ liệu. Chọn thời gian mà bạn cảm thấy thoải mái nhất. Khi bắt đầu, bạn nên dành 15 phút để làm quen với quy trình và các câu hỏi.

source: Add Photo
id: Sisipkan Foto
th: แทรกรูปภาพ
vi: Chèn ảnh

source: Administration
id: Administrasi
th: การบริหาร
vi: Sự quản lý

source: Analyse the Report
id: Menganalisis Laporan
th: วิเคราะห์รายงาน
vi: Phân tích báo cáo

source: Any final comments?
id: Ada komentar akhir?
th: มีความคิดเห็นสุดท้ายอะไรอีกไหม?
vi: Bạn có bình luận cuối cùng nào không?

source: Are you sure you want to delete this image?
id: Apakah Anda yakin ingin menghapus gambar ini?
th: คุณแน่ใจว่าต้องการลบภาพนี้หรือไม่?
vi: Bạn có chắc chắn muốn xóa hình ảnh này không?

source: Are you sure you want to end the observation session?
id: Apakah Anda yakin ingin mengakhiri sesi observasi?
th: คุณแน่ใจว่าต้องการยุติเซสชันการสังเกตการณ์หรือไม่?
vi: Bạn có chắc chắn muốn kết thúc buổi quan sát không?

source: Assessment
id: Penilaian
th: การประเมิน
vi: Đánh giá

source: Attach images of the classroom into the report.
id: Lampirkan gambar kelas ke dalam laporan.
th: แนบรูปภาพห้องเรียนเข้าในรายงาน
vi: Đính kèm hình ảnh lớp học vào báo cáo.

source: Average
id: Rata-rata
th: เฉลี่ย
vi: Trung bình

source: Average Number of Technologies Used
id: Rata-rata Jumlah Teknologi yang Digunakan
th: จำนวนเฉลี่ยของเทคโนโลยีที่ใช้
vi: Số lượng công nghệ trung bình được sử dụng

source: Based on the total count of how the technologies are used.
id: Berdasarkan jumlah total bagaimana teknologi digunakan.
th: ตามจำนวนรวมของการใช้เทคโนโลยี
vi: Dựa trên tổng số cách thức sử dụng công nghệ.

source: By App
id: Dengan Aplikasi
th: โดยแอป
vi: Bằng ứng dụng

source: By Purpose
id: Berdasarkan Tujuan
th: ตามวัตถุประสงค์
vi: Theo mục đích

source: Cancel
id: Batal
th: ยกเลิก
vi: Hủy bỏ

source: Caption
id: Keterangan Gambar
th: คำบรรยาย
vi: Đầu đề

source: Choose from Photos
id: Pilih dari Foto
th: เลือกจากภาพถ่าย
vi: Chọn từ Ảnh

source: Class
id: Kelas
th: ระดับ
vi: Lớp học

source: Class Duration
id: Durasi Kelas
th: ระยะเวลาเรียน
vi: Thời lượng lớp học

source: Close Observation Record
id: Catatan Observasi Dekat
th: บันทึกการสังเกตอย่างใกล้ชิด
vi: Bản ghi quan sát chặt chẽ

source: Close Without Saving
id: Tutup Tanpa Menyimpan
th: ปิดโดยไม่บันทึก
vi: Đóng mà không lưu

source: Comments
id: Komentar
th: ความคิดเห็น
vi: Bình luận

source: Comments (%lld)
id: Komentar (%lld)
th: ความคิดเห็น (%lld)
vi: Bình luận (%lld)

source: Complete and Close
id: Selesai dan Tutup
th: เสร็จสมบูรณ์และปิด
vi: Hoàn thành và Đóng

source: Content presentation – Data collection
id: Presentasi konten – Pengumpulan data
th: การนำเสนอเนื้อหา – การรวบรวมข้อมูล
vi: Trình bày nội dung – Thu thập dữ liệu

source: Count
id: Menghitung
th: นับ
vi: Đếm

source: Count of the number of students working with technology at each observation.
id: Jumlah siswa yang bekerja dengan teknologi pada setiap pengamatan.
th: นับจำนวนนักศึกษาที่ทำงานร่วมกับเทคโนโลยีในแต่ละจุดสังเกต
vi: Đếm số học sinh sử dụng công nghệ trong mỗi lần quan sát.

source: Create
id: Membuat
th: สร้าง
vi: Tạo nên

source: Create a new observation every %lld minutes to get consistent results!
id: Buat observasi baru setiap %lld menit untuk mendapatkan hasil yang konsisten!
th: สร้างการสังเกตใหม่ทุกๆ %lld นาทีเพื่อให้ได้ผลลัพธ์ที่สอดคล้องกัน!
vi: Tạo một quan sát mới sau mỗi %lld phút để có được kết quả nhất quán!

source: Create a new session to get started!
id: Buat sesi baru untuk memulai!
th: สร้างเซสชั่นใหม่เพื่อเริ่มต้น!
vi: Tạo một phiên mới để bắt đầu!

source: Create a Record
id: Buat Rekaman
th: สร้างบันทึก
vi: Tạo một bản ghi

source: Create an Observation
id: Membuat Observasi
th: สร้างการสังเกต
vi: Tạo một quan sát

source: Create New Observation
id: Buat Observasi Baru
th: สร้างการสังเกตใหม่
vi: Tạo quan sát mới

source: Create New Session
id: Buat Sesi Baru
th: สร้างเซสชั่นใหม่
vi: Tạo phiên mới

source: Create Observation Now
id: Buat Observasi Sekarang
th: สร้างการสังเกตตอนนี้
vi: Tạo quan sát ngay

source: Custom
id: Kebiasaan
th: กำหนดเอง
vi: Phong tục

source: Delete
id: Menghapus
th: ลบ
vi: Xóa bỏ

source: Delete Image
id: Hapus Gambar
th: ลบรูปภาพ
vi: Xóa hình ảnh

source: Digital product creation
id: Pembuatan produk digital
th: การสร้างผลิตภัณฑ์ดิจิตอล
vi: Tạo sản phẩm kỹ thuật số

source: Discussion
id: Diskusi
th: การอภิปราย
vi: Cuộc thảo luận

source: Done
id: Selesai
th: เสร็จแล้ว
vi: Xong

source: Duration
id: Lamanya
th: ระยะเวลา
vi: Khoảng thời gian

source: End Session
id: Akhiri Sesi
th: สิ้นสุดเซสชั่น
vi: Kết thúc phiên

source: Enrolment
id: Pendaftaran
th: การลงทะเบียน
vi: Đăng ký

source: Grade
id: Nilai
th: ระดับ
vi: Cấp

source: Group work
id: Pekerjaan kelompok
th: การทำงานเป็นกลุ่ม
vi: Làm việc nhóm

source: Group Work
id: Pekerjaan Kelompok
th: การทำงานเป็นกลุ่ม
vi: Làm việc nhóm

source: Highly Engaged
id: Sangat Terlibat
th: มีส่วนร่วมสูง
vi: Rất tích cực

source: How confident the students were with various technologies used within the classroom, when rated on a scale of 1 to 5.
id: Seberapa yakin siswa terhadap berbagai teknologi yang digunakan di kelas, ketika dinilai pada skala 1 hingga 5.
th: ความมั่นใจของนักเรียนกับเทคโนโลยีต่างๆ ที่ใช้ในห้องเรียน เมื่อประเมินในระดับ 1 ถึง 5
vi: Mức độ tự tin của học sinh với các công nghệ khác nhau được sử dụng trong lớp học, khi đánh giá theo thang điểm từ 1 đến 5.

source: How confident the teacher was with various technologies used within the classroom, when rated on a scale of 1 to 5.
id: Seberapa yakin guru tersebut terhadap berbagai teknologi yang digunakan di dalam kelas, ketika dinilai pada skala 1 hingga 5.
th: ความมั่นใจของครูต่อเทคโนโลยีต่างๆ ที่ใช้ในห้องเรียน เมื่อประเมินในระดับ 1 ถึง 5
vi: Mức độ tự tin của giáo viên với các công nghệ khác nhau được sử dụng trong lớp học, khi đánh giá theo thang điểm từ 1 đến 5.

source: How is the teacher using each technology?
id: Bagaimana guru menggunakan setiap teknologi?
th: ครูใช้เทคโนโลยีแต่ละอย่างอย่างไร?
vi: Giáo viên sử dụng từng công nghệ như thế nào?

source: How many students are doing [Group Work](https://example.com)?
id: Berapa banyak siswa yang mengerjakan [Kerja Kelompok](https://example.com)?
th: มีนักเรียนกี่คนที่[ทำการทำงานกลุ่ม](https://example.com])?
vi: Có bao nhiêu học sinh đang làm [Làm việc nhóm](https://example.com)?

source: How many students are doing [Independent Work](https://example.com)?
id: Berapa banyak siswa yang mengerjakan [Pekerjaan Mandiri](https://example.com)?
th: นักเรียนจำนวนกี่คนที่ทำ[การทำงานอิสระ](https://example.com)?
vi: Có bao nhiêu học sinh đang làm [Bài tập độc lập](https://example.com)?

source: How many students are doing [Pair Work](https://example.com)?
id: Berapa banyak siswa yang mengerjakan [Pekerjaan Berpasangan](https://example.com)?
th: นักเรียนจำนวนกี่คนกำลัง[ทำงานเป็นคู่](https://example.com)?
vi: Có bao nhiêu học sinh đang làm [Bài tập theo cặp](https://example.com)?

source: How many students are doing Group Work?
id: Berapa banyak siswa yang mengerjakan Kerja Kelompok?
th: มีนักเรียนกี่คนที่ทำการทำงานกลุ่ม?
vi: Có bao nhiêu học sinh đang làm bài tập nhóm?

source: How many students are doing Independent Work?
id: Berapa banyak siswa yang mengerjakan Pekerjaan Mandiri?
th: นักเรียนจำนวนกี่คนที่ทำการงานอิสระ?
vi: Có bao nhiêu học sinh đang làm bài tập độc lập?

source: How many students are doing Pair Work?
id: Berapa banyak siswa yang mengerjakan Kerja Berpasangan?
th: นักเรียนจำนวนกี่คนกำลังทำงานเป็นคู่?
vi: Có bao nhiêu học sinh đang làm bài tập theo cặp?

source: How many students are working with technology?
id: Berapa banyak siswa yang bekerja dengan teknologi?
th: มีนักเรียนจำนวนกี่คนที่ทำงานกับเทคโนโลยี?
vi: Có bao nhiêu sinh viên đang làm việc với công nghệ?

source: How Technology is Being Used
id: Bagaimana Teknologi Digunakan
th: เทคโนโลยีถูกนำมาใช้อย่างไร
vi: Công nghệ đang được sử dụng như thế nào

source: How Technology is Used by Teacher
id: Bagaimana Teknologi Digunakan oleh Guru
th: ครูใช้เทคโนโลยีอย่างไร
vi: Công nghệ được Giáo viên sử dụng như thế nào

source: Images
id: Gambar
th: รูปภาพ
vi: Hình ảnh

source: Independent work
id: Pekerjaan mandiri
th: การทำงานอิสระ
vi: Công việc độc lập

source: Independent Work
id: Pekerjaan Mandiri
th: การทำงานอิสระ
vi: Công việc độc lập

source: Information
id: Informasi
th: ข้อมูล
vi: Thông tin

source: Interacting With Students
id: Berinteraksi dengan Siswa
th: การโต้ตอบกับนักเรียน
vi: Tương tác với sinh viên

source: Interval
id: Selang
th: ช่วงเวลา
vi: Khoảng cách

source: Lesson Time
id: Waktu Pelajaran
th: เวลาเรียน
vi: Giờ học

source: List down the questions posed (if any)
id: Buatlah daftar pertanyaan yang diajukan (jika ada)
th: ระบุคำถามที่ถูกถาม (ถ้ามี)
vi: Liệt kê các câu hỏi được đặt ra (nếu có)

source: List the hardware as well as the software application being used
id: Daftarkan perangkat keras serta aplikasi perangkat lunak yang digunakan
th: แสดงรายการฮาร์ดแวร์รวมถึงซอฟต์แวร์แอปพลิเคชันที่กำลังใช้งานอยู่
vi: Liệt kê phần cứng cũng như ứng dụng phần mềm đang được sử dụng

source: Longer observation durations can allow for more time to input data.
id: Durasi observasi yang lebih lama dapat memberikan lebih banyak waktu untuk memasukkan data.
th: ระยะเวลาการสังเกตที่นานขึ้นจะช่วยให้มีเวลาในการป้อนข้อมูลมากขึ้น
vi: Thời gian quan sát dài hơn có thể cho phép có nhiều thời gian hơn để nhập dữ liệu.

source: Median
id: Modus
th: มัธยฐาน
vi: Trung vị thống kê

source: Mode
id: Median
th: โหมดเชิงสถิติ
vi: Chế độ thống kê

source: New Session
id: Sesi Baru
th: เซสชันใหม่
vi: Phiên mới

source: Next
id: Berikutnya
th: ต่อไป
vi: Kế tiếp

source: No Caption
id: Tidak ada teks
th: ไม่มีคำบรรยาย
vi: Không có chú thích

source: No Session Selected
id: Tidak Ada Sesi yang Dipilih
th: ไม่มีการเลือกเซสชัน
vi: Không có phiên nào được chọn

source: No Sessions Available
id: Tidak Ada Sesi yang Tersedia
th: ไม่มีเซสชั่นที่พร้อมใช้งาน
vi: Không có phiên nào có sẵn

source: Non-instructional
id: Non-instruksional
th: ไม่ใช่การเรียนการสอน
vi: Không hướng dẫn

source: Not Engaged
id: Tidak Bertunangan
th: ไม่หมั้นหมาย
vi: Không đính hôn

source: Number
id: Nomor
th: ตัวเลข
vi: Con số

source: Observation at %@
id: Observasi jam %@
th: สังเกตการณ์เวลา %@
vi: Quan sát lúc %@

source: Observation Duration
id: Durasi Observasi
th: ระยะเวลาการสังเกต
vi: Thời gian quan sát

source: Observation Interval
id: Selang Observasi
th: ช่วงเวลาการสังเกต
vi: Khoảng thời gian quan sát

source: Observation Report
id: Laporan Observasi
th: รายงานการสังเกต
vi: Báo cáo quan sát

source: Observations
id: Observasi
th: การสังเกต
vi: Quan sát

source: Observations Recorded
id: Observasi Dicatat
th: การสังเกตที่บันทึกไว้
vi: Quan sát được ghi lại

source: On a scale of 1 to 5, with 1 being not engaged and 5 being highly engaged. Consider the following: • Content is presented to students in multiple modalities • Students choose what and how they use technology • Students choose how they complete the given task
id: Pada skala 1 hingga 5, dengan 1 berarti tidak terlibat dan 5 berarti sangat terlibat. Pertimbangkan hal berikut: • Konten disajikan kepada siswa dalam berbagai cara • Siswa memilih apa dan bagaimana mereka menggunakan teknologi • Siswa memilih bagaimana mereka menyelesaikan tugas yang diberikan
th: โดยใช้มาตราส่วน 1 ถึง 5 โดย 1 คือไม่มีส่วนร่วม และ 5 คือมีส่วนร่วมมาก พิจารณาสิ่งต่อไปนี้: • เนื้อหาจะถูกนำเสนอต่อนักเรียนในรูปแบบต่างๆ • นักเรียนเลือกว่าจะใช้เทคโนโลยีอะไรและอย่างไร • นักเรียนเลือกวิธีทำงานที่ได้รับมอบหมายให้เสร็จสมบูรณ์
vi: Theo thang điểm từ 1 đến 5, với 1 là không tham gia và 5 là rất tham gia. Hãy xem xét những điều sau: • Nội dung được trình bày cho học sinh theo nhiều phương thức • Học sinh chọn công nghệ nào và cách sử dụng công nghệ nào • Học sinh chọn cách hoàn thành nhiệm vụ được giao

source: On a scale of 1 to 5.
id: Pada skala 1 sampai 5.
th: ในระดับ 1 ถึง 5
vi: Theo thang điểm từ 1 đến 5.

source: Once you have set it up, get started by creating an observation. Follow the questions on screen and fill it out based on what you observe in the classroom. You will be prompted to submit a new observation every 10 or 15 minutes, based on your Recording Duration.
id: Setelah Anda mengaturnya, mulailah dengan membuat sebuah observasi. Ikuti pertanyaan-pertanyaan di layar dan isi berdasarkan apa yang Anda amati di kelas. Anda akan diminta untuk mengirimkan observasi baru setiap 10 atau 15 menit, berdasarkan Durasi Rekaman Anda.
th: เมื่อคุณตั้งค่าเรียบร้อยแล้ว ให้เริ่มต้นด้วยการสร้างการสังเกต ทำตามคำถามบนหน้าจอและกรอกตามสิ่งที่คุณสังเกตในห้องเรียน คุณจะได้รับแจ้งให้ส่งการสังเกตใหม่ทุกๆ 10 หรือ 15 นาที โดยขึ้นอยู่กับระยะเวลาการบันทึกของคุณ
vi: Sau khi thiết lập xong, hãy bắt đầu bằng cách tạo một quan sát. Làm theo các câu hỏi trên màn hình và điền vào dựa trên những gì bạn quan sát được trong lớp học. Bạn sẽ được nhắc nộp một quan sát mới sau mỗi 10 hoặc 15 phút, dựa trên Thời lượng ghi âm của bạn.

source: Optional
id: Opsional
th: ไม่จำเป็น
vi: Không bắt buộc

source: Other
id: Lainnya
th: อื่น
vi: Khác

source: Pair work
id: Kerja berpasangan
th: ทำงานเป็นคู่
vi: Làm việc theo cặp

source: Pair Work
id: Pekerjaan berpasangan
th: ทำงานเป็นคู่
vi: Làm việc theo cặp

source: Pedagram Report
id: Laporan Pedagram
th: รายงาน Pedagram
vi: Báo cáo Pedagram

source: Photo
id: Foto
th: รูปถ่าย
vi: Ảnh

source: Photos
id: Foto
th: ภาพถ่าย
vi: Hình ảnh

source: Pick a Recording Duration
id: Pilih Durasi Rekaman
th: เลือกระยะเวลาในการบันทึก
vi: Chọn thời lượng ghi âm

source: Previous
id: Sebelumnya
th: ก่อนหน้า
vi: Trước

source: Questions Asked
id: Pertanyaan yang Diajukan
th: คำถามที่ถูกถาม
vi: Câu hỏi được hỏi

source: Questions Posed
id: Pertanyaan yang Diajukan
th: คำถามที่ถูกตั้ง
vi: Câu hỏi được đặt ra

source: Questions posed by the teacher
id: Pertanyaan yang diajukan oleh guru
th: คำถามที่คุณครูตั้ง
vi: Những câu hỏi được giáo viên đặt ra

source: Questions posed by the teacher to the students.
id: Pertanyaan yang diajukan oleh guru kepada siswa.
th: คำถามที่ครูถามนักเรียน
vi: Những câu hỏi mà giáo viên đặt ra cho học sinh.

source: Record the class, subject, duration, and other additional details. This information will show up in the report.
id: Catat kelas, subjek, durasi, dan detail tambahan lainnya. Informasi ini akan muncul dalam laporan.
th: บันทึกชั้นเรียน วิชา ระยะเวลา และรายละเอียดเพิ่มเติมอื่นๆ ข้อมูลนี้จะปรากฏในรายงาน
vi: Ghi lại lớp học, môn học, thời lượng và các thông tin bổ sung khác. Thông tin này sẽ hiển thị trong báo cáo.

source: Report
id: Laporan
th: รายงาน
vi: Báo cáo

source: Report generated on %@ by [Pedagram](https://pedagram.com) (pedagram.com).
id: Laporan dibuat pada %@ oleh [Pedagram](https://pedagram.com) (pedagram.com).
th: รายงานสร้างขึ้นเมื่อ %@ โดย [Pedagram](https://pedagram.com) (pedagram.com)
vi: Báo cáo được tạo vào ngày %@ bởi [Pedagram](https://pedagram.com) (pedagram.com).

source: Report generated on %@ by [Pedagram](https://pedagram.com).
id: Laporan dibuat pada %@ oleh [Pedagram](https://pedagram.com).
th: รายงานสร้างขึ้นเมื่อ %@ โดย [Pedagram](https://pedagram.com)
vi: Báo cáo được tạo vào ngày %@ bởi [Pedagram](https://pedagram.com)

source: Select a session to open it!
id: Pilih sesi untuk membukanya!
th: เลือกเซสชั่นเพื่อเปิด!
vi: Chọn một phiên để mở!

source: Sessions
id: Sesi
th: เซสชั่น
vi: Phiên họp

source: Set the interval between each observation. You would be notified to create a new observation every %lld minutes.
id: Tetapkan interval antara setiap observasi. Anda akan diberi tahu untuk membuat observasi baru setiap %lld menit.
th: กำหนดช่วงเวลาระหว่างการสังเกตแต่ละครั้ง คุณจะได้รับการแจ้งเตือนให้สร้างการสังเกตใหม่ทุก ๆ %lld นาที
vi: Đặt khoảng thời gian giữa mỗi lần quan sát. Bạn sẽ được thông báo tạo một quan sát mới sau mỗi %lld phút.

source: Set Up Your Session
id: Siapkan Sesi Anda
th: ตั้งค่าเซสชันของคุณ
vi: Thiết lập phiên của bạn

source: Shorter observation durations can provide more granular data entry.
id: Durasi observasi yang lebih pendek dapat memberikan entri data yang lebih terperinci.
th: ระยะเวลาการสังเกตที่สั้นลงสามารถให้รายการข้อมูลที่ละเอียดยิ่งขึ้น
vi: Thời gian quan sát ngắn hơn có thể cung cấp dữ liệu nhập chi tiết hơn.

source: Standard Deviation
id: Deviasi Standar
th: ค่าเบี่ยงเบนมาตรฐาน
vi: Độ lệch chuẩn

source: Start Recording
id: Mulai Merekam
th: เริ่มการบันทึก
vi: Bắt đầu ghi âm

source: Student Engagement
id: Keterlibatan Siswa
th: การมีส่วนร่วมของนักศึกษา
vi: Sự tham gia của sinh viên

source: Students doing…
id: Siswa melakukan…
th: นักเรียนกำลังทำ…
vi: Học sinh đang làm…

source: Students working with technology
id: Siswa bekerja dengan teknologi
th: นักศึกษาทำงานกับเทคโนโลยี
vi: Học sinh làm việc với công nghệ

source: Students’ Confidence in Technology
id: Kepercayaan Diri Siswa terhadap Teknologi
th: ความมั่นใจของนักศึกษาต่อเทคโนโลยี
vi: Sự tự tin của học sinh vào công nghệ

source: Subject
id: Subjek
th: เรื่อง
vi: Chủ thể

source: Take Photo
id: Ambil Foto
th: ถ่ายรูป
vi: Chụp ảnh

source: Task
id: Tugas
th: งาน
vi: Nhiệm vụ

source: Teacher doing…
id: Guru melakukan…
th: ครูกำลังทำ…
vi: Giáo viên đang làm…

source: Teacher’s Confidence in Technology
id: Kepercayaan Guru terhadap Teknologi
th: ความมั่นใจของครูต่อเทคโนโลยี
vi: Niềm tin của giáo viên vào công nghệ

source: Technology used by teacher
id: Teknologi yang digunakan oleh guru
th: เทคโนโลยีที่ครูใช้
vi: Công nghệ được giáo viên sử dụng

source: The task set by the teacher is categorised into _active_, _collaborative_, _constructive_, _authentic_, and _goal directed_. **Active**: Students are engaged in using technology as a tool rather than passively receiving information from the technology. **Collaborative**: Students use technology tools to collaborate with others rather than working individually at all times. **Constructive**: Students use technology tools to connect new information to their prior knowledge rather than to passively receive information." **Authentic**: Students use technology tools to link learning activities to the world beyond the instructional setting rather than working on decontextualized assignments. **Goal Directed**: Students use technology tools to set goals, plan activities, monitor progress, and evaluate results rather than simply completing assignments without reflection.
id: Tugas yang ditetapkan oleh guru dikategorikan menjadi _aktif_, _kolaboratif_, _konstruktif_, _asli_, dan _berorientasi pada tujuan_. **Aktif**: Siswa terlibat dalam penggunaan teknologi sebagai alat alih-alih menerima informasi dari teknologi secara pasif. **Kolaboratif**: Siswa menggunakan alat teknologi untuk berkolaborasi dengan orang lain alih-alih bekerja secara individual setiap saat. **Konstruktif**: Siswa menggunakan alat teknologi untuk menghubungkan informasi baru dengan pengetahuan sebelumnya alih-alih menerima informasi secara pasif. **Autentik**: Siswa menggunakan alat teknologi untuk menghubungkan kegiatan pembelajaran dengan dunia di luar lingkungan pembelajaran alih-alih mengerjakan tugas yang tidak terkait dengan konteks. **Berorientasi pada Tujuan**: Siswa menggunakan alat teknologi untuk menetapkan tujuan, merencanakan kegiatan, memantau kemajuan, dan mengevaluasi hasil alih-alih sekadar menyelesaikan tugas tanpa refleksi.
th: งานที่ครูมอบหมายให้แบ่งตามประเภท ได้แก่ _เชิงรุก_ _เชิงร่วมมือ_ _เชิงสร้างสรรค์_ _แท้จริง_ และ _มุ่งเป้าหมาย_ **เชิงรุก**: นักเรียนมีส่วนร่วมในการใช้เทคโนโลยีเป็นเครื่องมือแทนที่จะรับข้อมูลจากเทคโนโลยีอย่างเฉื่อยๆ **เชิงร่วมมือ**: นักเรียนใช้เครื่องมือเทคโนโลยีเพื่อทำงานร่วมกับผู้อื่นแทนที่จะทำงานเป็นรายบุคคลตลอดเวลา **เชิงสร้างสรรค์**: นักเรียนใช้เครื่องมือเทคโนโลยีเพื่อเชื่อมโยงข้อมูลใหม่กับความรู้เดิมแทนที่จะรับข้อมูลอย่างเฉื่อยๆ" **เชิงจริง**: นักเรียนใช้เครื่องมือเทคโนโลยีเพื่อเชื่อมโยงกิจกรรมการเรียนรู้กับโลกภายนอกการเรียนการสอนแทนที่จะทำงานมอบหมายที่ไม่เกี่ยวข้องกับบริบท **มุ่งเป้าหมาย**: นักเรียนใช้เครื่องมือเทคโนโลยีเพื่อกำหนดเป้าหมาย วางแผนกิจกรรม ติดตามความคืบหน้า และประเมินผลแทนที่จะทำการบ้านเพียงอย่างเดียวโดยไม่ไตร่ตรอง
vi: Nhiệm vụ do giáo viên giao được phân loại thành _chủ động_, _hợp tác_, _xây dựng_, _chính thống_ và _hướng tới mục tiêu_. **Chủ động**: Học sinh tham gia sử dụng công nghệ như một công cụ thay vì thụ động tiếp nhận thông tin từ công nghệ. **Hợp tác**: Học sinh sử dụng các công cụ công nghệ để hợp tác với người khác thay vì làm việc riêng lẻ mọi lúc. **Xây dựng**: Học sinh sử dụng các công cụ công nghệ để kết nối thông tin mới với kiến ​​thức trước đó của mình thay vì thụ động tiếp nhận thông tin." **Chính thống**: Học sinh sử dụng các công cụ công nghệ để liên kết các hoạt động học tập với thế giới bên ngoài bối cảnh hướng dẫn thay vì làm các bài tập không theo ngữ cảnh. **Hướng tới mục tiêu**: Học sinh sử dụng các công cụ công nghệ để đặt mục tiêu, lập kế hoạch hoạt động, theo dõi tiến độ và đánh giá kết quả thay vì chỉ hoàn thành bài tập mà không suy nghĩ.

source: These are subjective comments taken from the observer.
id: Ini adalah komentar subjektif yang diambil dari pengamat.
th: สิ่งเหล่านี้เป็นความคิดเห็นส่วนตัวที่ได้รับมาจากผู้สังเกตการณ์
vi: Đây là những nhận xét chủ quan của người quan sát.

source: Time
id: Waktu
th: เวลา
vi: Thời gian

source: Time remaining before the next observation should be taken.
id: Waktu yang tersisa sebelum observasi berikutnya harus diambil.
th: ควรใช้ระยะเวลาที่เหลือก่อนการสังเกตการณ์ครั้งต่อไป
vi: Thời gian còn lại trước khi thực hiện quan sát tiếp theo.

source: Time until next observation
id: Waktu sampai observasi berikutnya
th: เวลาจนถึงการสังเกตครั้งต่อไป
vi: Thời gian cho đến lần quan sát tiếp theo

source: Type an item here.
id: Ketik item di sini.
th: พิมพ์รายการที่นี่
vi: Nhập một mục ở đây.

source: Type another item here.
id: Ketik item lainnya di sini.
th: พิมพ์รายการอื่นที่นี่
vi: Nhập mục khác vào đây.

source: Understand what the student is doing (independent work, pair work, or group work) compared to what the teacher is doing.
id: Memahami apa yang dilakukan siswa (kerja mandiri, kerja berpasangan, atau kerja kelompok) dibandingkan dengan apa yang dilakukan guru.
th: เข้าใจสิ่งที่นักเรียนกำลังทำ (การทำงานอิสระ การทำงานเป็นคู่ หรือการทำงานเป็นกลุ่ม) เทียบกับสิ่งที่ครูกำลังทำ
vi: Hiểu được những gì học sinh đang làm (làm việc độc lập, làm việc theo cặp hoặc làm việc nhóm) so với những gì giáo viên đang làm.

source: Value
id: Nilai
th: ค่า
vi: Giá trị
